[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["friends",{"version":1,"data":{"your_info":{"owned":true},"in_game":[],"played_recently":[],"played_ever":[{"steamid":"76561198972723487","minutes_played_forever":9},{"steamid":"76561198978103942","minutes_played_forever":78},{"steamid":"76561199019530707","minutes_played_forever":5},{"steamid":"76561198400225197","minutes_played_forever":1},{"steamid":"76561198314225111","minutes_played_forever":711},{"steamid":"76561199082212438","minutes_played_forever":69},{"steamid":"76561198452929332","minutes_played_forever":116}],"owns":[{"steamid":"76561198868593762"},{"steamid":"76561198881348856"},{"steamid":"76561198824936189"},{"steamid":"76561198819942792"}],"in_wishlist":[{"steamid":"76561198970337354"}]}}],["achievementmap",{"version":4,"data":"[]"}],["usernews",{"version":4,"data":["COoHEKW266UGGeEBsQEAAHABISaRCxoBABABKXBoCQAAAAAAUcnc5oUgLj4zYJGt66UG"]}],["gameactivity",{"version":4,"data":[]}],["socialmedia",{"version":3,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Brilliant Game Studios","strURL":"https://store.steampowered.com/curator/33338098"}],"rgPublishers":[{"strName":"Brilliant Game Studios","strURL":"https://store.steampowered.com/curator/33338098"}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[url]https://store.steampowered.com/app/1468720/Ultimate_Epic_Battle_Simulator_2/[/url]\r\n\r\nThe Game:\r\n\r\nHere is a sandbox like no other. Create massive battles with absolutely no limits. Want to see 10,000 chickens fight an army of Romans?? Sure, why not. Want to see a company of WW2 U.S soldiers fight 11,000 Medieval soldiers?? There are simply no limits to the carnage you can achieve in Epic Battle Simulator. Mess around with a massive variety of units. Everything from, Roman Centurions, Medieval soldiers, Knights, Orcs, Trolls, and yes, chickens! The main focus in this game is giving the player no restrictions to what he can do. That is why we decided not to limit the amount of units in battle. Want to see what a battle of 100,000 units looks like? We don't recommend going past 10,000 for most machines but its your CPU, do what you want! On top of that, you can play as any one of the units in the game, getting up close and personal to help change the tides of a massive battle, while rallying teammates and giving them orders!\r\n\r\nThe Technology:\r\n\r\nUnfortunately there really aren't many engines that you can chuck 10,000 characters in and expect good performance. This is why I worked months on end to create the most powerful crowd rendering system ever conceived in Unity engine. The detail of each character has little effect on performance while each individual acts independently, but is working towards a greater good for his team.  Each individual decides his own path and navigates complex environments. But I didn't stop there! With the large open environments, I needed a more dynamic lighting solution than the one built in to Unity engine. So I built my own dynamic global illumination lighting engine. This enables bounce light completely in real time. What does that mean? That means every piece of shiny armor is reflecting it's true surroundings, every bright surfaces illuminates it's surroundings and effects the overall lighting. \r\n\r\nYes I worked hard to bring this game to life, may you all inflict carnage upon it!","strSnippet":"Here is a sandbox like no other. Create massive battles with absolutely no limits. Want to see 10,000 chickens fight an army of Romans?? Sure, why not. Want to see a company of WW2 U.S soldiers fight 11,000 Medieval soldiers?? There are simply no limits to the carnage you can achieve in UEBS."}}],["workshop_trendy_items",{"version":2}]]